app/Models/DesaModel.php

    function countDesa(){
        $builder = $this->db->table('desa');
        $query = $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `desa`