app/Models/KaderModel.php

SELECT *
FROM `kader`
---
    function getData($where){
        $builder = $this->db->table('kader');
        $builder->where($where);

        return $builder->get()->getResult();

INSERT INTO `kader` (`nik`, `nama`, `hp`, `desa`, `kecamatan`) VALUES ('1234254523', 'Kader 1', '1312412142', 'Desa 1', 'Kecamatan 1')
---
    public function simpanData($data)
    {
        $this->db->table('kader')->insert($data);

UPDATE `kader` SET `nik` = '21313213', `nama` = 'Kader 3', `hp` = '2313123', `desa` = 'Kader 3', `kecamatan` = 'Kecamatan 3'
WHERE `id` = '4'
---
    public function editData($data, $where)
    {
        $this->db->table('kader')->update($data, $where);