app/Models/SimpatisanModel.php

    function getData(){
        $builder = $this->db->table('simpatisan');

        return $builder->get()->getResult();
---
SELECT *
FROM `simpatisan`

    public function simpanData($data)
    {
        $this->db->table('simpatisan')->insert($data);
---
INSERT INTO `simpatisan` (`nik`, `nama`, `hp`, `desa`, `kecamatan`, `id_kader`) VALUES ('13123', 'Simpatisan 2', '123123', 'Desa 2', 'Kecamatan 2', '3')

    public function hapusData($where)
    {
        $this->db->table('simpatisan')->delete($where);
---
DELETE FROM `simpatisan`
WHERE `id` = '1'