app/Models/SuaraModel.php

    function countTPS(){
        $builder = $this->db->table('suara');
        $query = $builder->countAll();
---
SELECT COUNT(*) AS `numrows` FROM `suara`